In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
dframe=DataFrame({'City':['Alma','Brian Head','Fox Park'],
                   'altitude':[3158,3000,2762]})

dframe

         City  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [4]:
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [7]:
dframe['state']=dframe['City'].map(state_map)

         City  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming

In [8]:
dframe['state']

0    Colorado
1        Utah
2     Wyoming
Name: state, dtype: object